import 'package:flutter/material.dart';

class AnimalPage extends StatelessWidget {
  const AnimalPage({Key? key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('สัตว์ท้องถิ่น'),
      ),
      body: ListView(
        children: const [
          Padding(
            padding: EdgeInsets.symmetric(horizontal: 20.0),
            child: Column(
              children: [
                Text(
                  'สัตว์ที่สุดยูนีค! ในประเทศออสเตรเลีย?',
                  style: TextStyle(fontSize: 18),
                ),

                SizedBox(height: 20),
                Text(
                  "1. จิงโจ้ (Kangaroo) ",
                  textAlign: TextAlign.center,
                ),
                Image(
                  image: AssetImage('images/kr.png'),
                  width: 300, // กำหนดความกว้างตามที่คุณต้องการ
                  height: 300,
                ),
                Text(
                  "จิงโจ้ เป็นสัญลักษณ์ประจำออสเตรเลียที่ดูน่ารักน่าเอ็นดู แต่จะเป็นอย่างที่เห็นหรือเปล่านะ? จิงโจ้เป็นสัตว์เลี้ยงลูกด้วยนมที่มีกระเป๋าหน้าท้อง มีหลายสายพันธุ์กระจายทั่วออสเตรเลีย มีขนสั้นสีน้ำตาล หูค่อนข้างยาว มีขาหลังที่ยาวและทรงพลังเพื่อใช้ในการกระโดด และยังมีหางที่แข็งแรงในการช่วยกระโดด พยุงตัวเวลายืน ต่อสู้ และว่ายน้ำด้วย จิงโจ้ตัวผู้มักทะเลาะและโชว์แม่ไม้มวยไทยอยู่บ่อยครั้ง ดังนั้นจิงโจ้ตัวผู้จะมีกล้ามเนื้อและมีผิวหนังหน้าท้องที่หนากว่า (เพื่อรับแรงกระแทกเวลาโดนเตะนั่นเอง) จิงโจ้เป็นสัตว์สังคม ชอบอยู่ร่วมตัวกันเป็นกลุ่มเป็นแก๊ง ผู้คนมักเรียกว่าเจ้าจิงโจ้สั้น ๆ ว่า Roos และ เรียกเจ้าเบบี๋จิงโจ้ว่า Joeys  อาหารที่ชื่นชอบ: จิงโจ้เป็นสัตว์กินพืช เช่น หญ้า ใบไม้ ผลไม้ และกินแมลงบางชนิดเพื่อเสริมโปรตีนให้กับกล้ามเนื้อ พิกัดในการเจอตัว: น้อง ๆ สามารถพบจิงโจ้ได้ในหลายพื้นที่ทั่วประเทศออสเตรเลีย เช่น Murramarang National Park และ Mungo National Park ในรัฐนิวเซาท์เวลส์, Kangaroo Island ใกล้เมืองแอดิเลด และ Maria Island ในรัฐแทสมาเนีย เป็นต้น ",
                  textAlign: TextAlign.center,
                ),
                // เพิ่มข้อมูลเมนูอาหารอื่น ๆ ที่คุณต้องการแสดงที่นี่
                SizedBox(height: 20),
                Text(
                  "2. โคอาลา (Koala)   ",
                  textAlign: TextAlign.center,
                ),
                Image(
                  image: AssetImage('images/koala.png'),
                  width: 300, // กำหนดความกว้างตามที่คุณต้องการ
                  height: 300,
                ),
                Text(
                  "ถ้าพูดถึงโคอาลาก็ต้องนึกถึงประเทศออสเตรเลียใช่มั้ยล่ะ! โคอาลาเป็นสัตว์เลี้ยงลูกด้วยนมที่มีกระเป๋าหน้าท้อง มีขนตัวและขนหูที่ดูปุกปุย (แต่จริง ๆ แล้วไม่ได้นุ่มอย่างที่เห็นนะ) ขนตัวจะมีสีเทาและสีขาวบริเวณคาง หน้าอก รวมถึงด้านหน้าของแขนและขา น้องโคอาลาเป็นสัตว์ที่นอนเก่ง ซึ่งใช้เวลามากกว่า 16 ชั่วโมงต่อวันในการนอนเพื่อเก็บรักษาพลังงานเอาไว้ออกหากินตอนกลางคืน เห็นน้องหน้าตาน่าเอ็นดูอย่างนี้ แต่น้องดุไม่เบาเลย อาหารที่ชื่นชอบ: ใบยูคาลิปตัส พิกัดในการเจอตัว: น้อง ๆ สามารถพบโคอาลาได้ในหลายรัฐ เช่น รัฐควีนส์แลนด์ รัฐนิวเซาท์เวลส์ รัฐวิกตอเรีย และ รัฐเซาท์ออสเตรเลีย ",
                  textAlign: TextAlign.center,
                ),
                //
                SizedBox(height: 20),
                Text(
                  "3. ควอกกา (Quokka )   ",
                  textAlign: TextAlign.center,
                ),
                Image(
                  image: AssetImage('images/quokaa.png'),
                  width: 300, // กำหนดความกว้างตามที่คุณต้องการ
                  height: 300,
                ),
                Text(
                  "ควอกกาเป็นจิงโจ้แคระที่มีหน้ายิ้มแย้มตลอดเวลา จนทำให้คนเรียกน้องว่าเป็น “สัตว์ที่มีความสุขที่สุดในโลก” ควอกก้าเป็นสัตว์เลี้ยงลูกด้วยนมและมีกระเป๋าหน้าท้อง มีขนสั้นสีน้ำตาลแกมเทา มีหางสั้น และหูสั้นกลม ๆ ควอกกาจะออกหากินตอนกลางคืน และ มักจะอยู่มีบริเวณที่มีต้นไม้เยอะและใกล้แหล่งน้ำ  อาหารที่ชื่นชอบ: ควอกกาเป็นสัตว์กินพืช ดังนั้น พวกมันจะกินหญ้าและใบไม้เป็นหลัก พิกัดในการเจอตัว: น้องควอกกาเป็นสัตว์ประจำเกาะร็อตเนสต์ (Rottnest Island) ซึ่งเป็นเกาะทางฝั่งตะวันตกเฉียงใต้ ใกล้เมืองเพิร์ธ รัฐเวสเทิร์สออสเตรเลีย แต่สามารถเจอควอกกาที่เกาะบอลล์ (Bald Island) ใกล้เมืองอัลบานี (Albany) ได้ด้วยเช่นกัน ",
                  textAlign: TextAlign.center,
                ),
                //
                SizedBox(height: 20),
                Text(
                  "4. วอลลาบี (Wallaby)  ",
                  textAlign: TextAlign.center,
                ),
                Image(
                  image: AssetImage('images/wallaby.png'),
                  width: 300, // กำหนดความกว้างตามที่คุณต้องการ
                  height: 300,
                ),
                Text(
                  "วอลลาบี หรือ จิงโจ้แคระ เป็นสัตว์ในตระกูลจิงโจ้ หน้าตารูปร่างคล้ายจิงโจ้ผสมกระต่าย แต่ตัวจะเล็กกว่าหน่อย เป็นสัตว์เลี้ยงลูกด้วยนมมีกระเป๋าหน้าท้อง น้องวอลลาบีนั้นมีหลายสายพันธุ์ เช่น Swamp Wallaby, Tammar Wallaby, Agile Wallaby, Red-necked Wallaby และ Brush-tailed Rock Wallaby เป็นต้น  อาหารที่ชื่นชอบ: วอลลาบีจะกินพืช ผัก ผลไม้ และหญ้าเป็นหลัก และจะออกหากินตอนกลางคืน  พิกัดในการเจอตัว: ประเทศออสเตรเลียมีวอลลาบีหลายสายพันธุ์ สามารถพบได้ในหลายเมืองและตามเกาะ เช่น ป่าในเมืองเมลเบิร์น ซิดนีย์ และบริสเบน ตามเกาะอย่าง Kangaroo Island, Philip Island และ Moreton Bay  ",
                  textAlign: TextAlign.center,
                ), //
                SizedBox(height: 20),
                Text(
                  "5. วอมแบต (Wombat)  ",
                  textAlign: TextAlign.center,
                ),
                Image(
                  image: AssetImage('images/wombat.png'),
                  width: 300, // กำหนดความกว้างตามที่คุณต้องการ
                  height: 300,
                ),
                Text(
                  "วอมแบตเป็นสัตว์เลี้ยงลูกด้วยนมและมีกระเป๋าหน้าท้อง น้องจะมีรูปร่างอ้วน ๆ กลม ๆ ขนปุยสีน้ำตาลอ่อน สีเทา หรือสีดำ มีหางและขาสั้น แต่เห็นน้องขาสั้นแบบนี้ น้องมีข้อขาที่แข็งแรงและมีเล็บขาหน้าที่คมมาก เพราะน้องจะใช้ขาหน้าในการขุดโพรงเพื่ออยู่อาศัยนั่นเอง แวมบอตจะชอบอยู่ในที่เย็นและหากินตอนกลางคืน  อาหารที่ชื่นชอบ: ของโปรดของวอมแบต คือ พืชและหญ้า    พิกัดในการเจอตัว: Cradle Mountain ในรัฐทัสมาเนีย Maria Island ในรัฐทัสมาเนีย อุทยานแห่งชาติ Wilsons Promontory ในรัฐวิคตอเรีย Kangaroo Valley ในรัฐนิวเซาท์เวลล์  ",
                  textAlign: TextAlign.center,
                ),
                //
                SizedBox(height: 20),
                Text(
                  "6. แทสมาเนียนเดวิล (Tasmanian Devil)  ",
                  textAlign: TextAlign.center,
                ),
                Image(
                  image: AssetImage('images/tasmanian.png'),
                  width: 300, // กำหนดความกว้างตามที่คุณต้องการ
                  height: 300,
                ),
                Text(
                  "แทสมาเนียนเดวิลเป็นสัตว์เลี้ยงลูกด้วยนมและมีกระเป๋าหน้าท้อง เห็นอย่างนี้น้องสามารถมีลูกในกระเป๋าหน้าท้องได้ถึง 6 ตัวเลยนะ น้องมีลักษณะคล้ายสุนัข มีขนสีดำหรือน้ำตาลและมีแถบแนวนอนสีขาวบริเวณลำตัว ขนาดลำตัวยาวประมาณ 3.5 ฟุต มีหูแหลมและหางยาว มีฟันและขากรรไกรที่แข็งแรงเพราะน้องเป็นสัตว์กินเนื้อ และจะออกหากินตอนกลางคืน  น้องเป็นหนึ่งในสัตว์ที่มีความเสี่ยงในการสูญพันธุ์เพราะถูกกำจัดและเกิดโรคระบาด ปัจจุบันมีแทสมาเนียนเดวิลเหลือเพียงประมาณ 20,000 เท่านั้น นอกจากนี้ แทสมาเนียนเดวิลยังเป็นคาแรคเตอร์นึงในการ์ตูน Looney Tunes อีกด้วย  อาหารที่ชื่นชอบ: แทสมาเนียนเดวิลเป็นสัตว์กินเนื้อ ดังนั้นน้องจะกินสัตว์แทบทุกชนิด ไม่ว่าจะเป็นปลา กบ นก แมลง หรือแม้แต่ซากสัตว์ พิกัดในการเจอตัว: เกาะทัสมาเนีย ซึ่งเป็นแหล่งต้นกำเนิดของน้องแทสมาเนียนเดวิลนั่นเอง  ",
                  textAlign: TextAlign.center,
                ),
                //
                SizedBox(height: 20),
                Text(
                  "7. นกแคสโซแวรี (Cassowary)  ",
                  textAlign: TextAlign.center,
                ),
                Image(
                  image: AssetImage('images/cassowary.png'),
                  width: 300, // กำหนดความกว้างตามที่คุณต้องการ
                  height: 300,
                ),
                Text(
                  "นกแคสโซแวรีเป็นนกที่มีขนาดใหญ่ที่สุดเป็นอันดับ 3 ของโลก (รองจากนกกระจอกเทศและนกอีมู) มีขนสีดำคลุมลำตัว ลำคอยาว บริเวณหน้าและลำคอจะมีสีสันที่สดใสตามแต่ละชนิด จุดเด่นคือหงอนขนาดใหญ่ที่ตั้งอยู่บนหัวเสมือนใส่หมวกอยู่ตลอดเวลา ถึงแม้ว่าจะได้ชื่อว่าเป็นนก แต่แคสโซแวรีนั้นเป็นนกที่บินไม่ได้ ด้วยนิสัยที่ดุร้ายและขี้หงุดหงิด ทำให้นกแคสโซวารีจัดว่าเป็น “นกที่อันตรายที่สุดในโลก” จนต้องบันทึกไว้ใน Guinness World Records เลยทีเดียว  นกแคสโซแวรีมีกรงเล็บที่แหลมคมไว้ใช้เป็นอาวุธในการป้องกันตัวและกระโดดถีบศัตรู หรือผู้รุกรานถึงตายได้ นกแคสโซแวรีนี้ไม่ชอบอยู่เป็นกลุ่ม มักจะอยู่ตามป่าดิบชื้นและออกหากินตอนค่ำ ๆ  อาหารที่ชื่นชอบ: นกแคสโซแวรีชอบกินพวกผลไม้ เห็ด รวมถึงเนื้อสัตว์ด้วย   พิกัดในการเจอตัว: สายพันธุ์ที่เจอได้ที่ประเทศออสเตรเลีย คือ Southern Cassowary มักจะพบได้ในแถบป่าดิบชื้นทางตะวันออกเฉียงเหนือของรัฐควีนส์แลนด์ เช่น Etty Bay, Mission Beach, Edmund Kennedy National Park และ Daintree Rainforest เป็นต้น แต่บางครั้งเจ้านกก็ออกมาหากินข้างนอก ทำให้เราอาจจะได้เห็นตามถนน ชายหาด หรือในชุมชนที่คนอยู่อาศัยได้ด้วย    ",
                  textAlign: TextAlign.center,
                ),
                //
                SizedBox(height: 20),
                Text(
                  "8. หมาป่าดิงโก (Dingo)  ",
                  textAlign: TextAlign.center,
                ),
                Image(
                  image: AssetImage('images/dingo.png'),
                  width: 300, // กำหนดความกว้างตามที่คุณต้องการ
                  height: 300,
                ),
                Text(
                  "หมาป่าดิงโก ดูหน้าตาแล้วคล้าย ๆ หมาบ้านเรา คือมีขนสั้น หางเป็นพวง ส่วนใหญ่สีขนจะเป็นสีน้ำตาลอมเหลือง แต่รู้มั้ยว่าหมาป่าดิงโกเป็นหนึ่งในสัตว์ที่อันตรายที่สุดชนิดหนึ่งในออสเตรเลีย! หมาป่าดิงโกนี้เป็นนักล่าที่ชอบรวมตัวกันอยู่เป็นฝูง มีความปราดเปรียว และมักจะชอบอยู่ตามป่าไม้และทุ่งหญ้า อาหารที่ชื่นชอบ: หมาป่าดิงโกเป็นสัตว์กินเนื้อ มักจะล่าพวกกกระต่าย วอลลาบี วอมแบต จิงโจ้ สัตว์เลื้อยคลาย และนก เป็นต้น และจะออกหากินตอนกลางคืน พิกัดในการเจอตัว: หมาป่าดิงโกอยู่กระจายในทั่วทุกรัฐในประเทศออสเตรเลีย และพบเห็นในทั้งในทะเลทราย ป่าไม้ ป่าดิบชื้น ทุ่งหญ้า และภูเขา   ",
                  textAlign: TextAlign.center,
                ),
              ],
            ),
          ),
        ],
      ),
    );
  }
}
