import 'package:flutter/material.dart';

class JauntPage extends StatelessWidget {
  const JauntPage({Key? key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('การเดินทาง'),
      ),
      body: ListView(
        children: const [
          Padding(
            padding: EdgeInsets.symmetric(horizontal: 20.0),
            child: Column(
              children: [
                Text(
                  'วิธีการเดินทางในประเทศออสเตรเลีย',
                  style: TextStyle(fontSize: 18),
                ),
                SizedBox(height: 20),
                Text(
                  "1. การคมนาคมทางบก",
                   style: TextStyle(fontSize: 16),
                  textAlign: TextAlign.center,
                ),
                Text(
                  "การคมนาคมทางบกทางรถยนต์ ทางรถยนต์จะหนาแน่นมากแถบตะวันออกและตะวันออกเฉียงใต้ของประเทศ เนื่องจากเป็นเขตที่มีประชากรอาศัยอยู่อย่างหนาแน่น มีอุตสาหกรรม การค้าและบริการต่าง ๆ เงื่อนไขดังกล่าวจึงทำให้มีจำนวนรถยนต์ที่หนาแน่นนอกจากนี้ระหว่างเมืองหลวงของรัฐและเมืองใหญ่จะมีทางหลวงเชื่อมติดต่อกัน ทำให้การคมนาคมสะดวกมากขึ้น \n ทางรถไฟ ทางรถไฟจะหนาแน่นมากแถบตะวันออกและตะวันออกเฉียงใต้นอกจากนี้ยังปรากฏทางรถไฟสายยาวที่เชื่อมระหว่างเมืองซิดนีย์เมืองหลวงของรัฐนิวเซาท์เวลส์กับเมืองเพิร์ท เมืองหลวงของรัฐเวสเทิร์นออสเตรเลีย ในลักษณะแนวตะวันออก-ตะวันตกขนานไปกับชายฝั่งอ่าวเกรตออสเตรเลีย เพื่อใช้ในการขนส่งทั้งประชากร สินค้าและบริการต่าง ๆ ซึ่งถือเป็นทางรถไฟที่มีความยาวที่สุดในประเทศออสเตรเลียเรียกว่า ทางรถไฟสายทรานส์ออสเตรเลียน",
                  textAlign: TextAlign.center,
                ),
                 Image(
                  image: AssetImage('images/train.jpg'),
                  width: 300, // กำหนดความกว้างตามที่คุณต้องการ
                  height: 300,
                ),
                SizedBox(height: 20),
                Text(
                  "2. การคมนาคมทางน้ำ",
                   style: TextStyle(fontSize: 16),
                  textAlign: TextAlign.center,
                ),
                Text(
                  "การคมนาคมทางน้ำโดยอาศัยพาหนะุหลักคือเรือ การเดินเรือบริเวณแหล่งน้ำในแผ่นดินจะปรากฏน้อยมาก อันมีผลมาจากสภาพทางธรรมชาติที่ประเทศออสเตรเลียมีแม่น้ำอยู่น้อยสาย ส่วนใหญ่เป็นสายเล็ก สั้น และมักจะเป็นแหล่งน้ำเฉพาะฤดูฝน ส่วนช่วงแล้งน้ำมักแห้งขอด ทำให้ไม่สามารถเดินเรือได้ แต่การคมนาคมทางน้ำที่เด่นที่สุดของประเทศออสเตรเลียคือ การเดินเรือในทะเล มีทั้งการเดินเรือระหว่างเมืองกับการเดินเรือสมุทร ระหว่างทวีป เนื่องจากเงื่อนไขของตำแหน่งที่ตั้งที่เป็นเกาะซึ่งล้อมรอบด้วยน้ำทะเล และมีชายฝั่งลาดชันหลายแห่งที่มีน้ำทะเลลึกค่อนข้างมากทำให้เอื้อต่อการสร้างท่าเรือน้ำลึกขนาดใหญ่ที่เรือเดินสมุทรสามารถเข้ามาจอดเทียบท่าได้ โดยไม่ต้องขนถ่ายลงเรือเล็กซึ่งจะทำให้เพิ่มค่าใช้จ่ายในการขนส่งสินค้าเพิ่มขึ้น ท่าเรือขนาดใหญ่ของประเทศออสเตรเลีย ได้แก่ ท่าเรื่องเมืองร็อคแฮมป์ตัน ท่าเรือเมืองบริสเบนในรัฐควีส์แลนด์ ท่าเรือเมืองซิดนีย์ในรัฐนิวเซาท์เวลส์ ท่าเรือเมืองเพิร์ทและท่าเรือเมืองพอร์ตเฮดแลนด์ในรัฐเวสเทิร์นออสเตรเลีย",
                  textAlign: TextAlign.center,
                ),
                 Image(
                  image: AssetImage('images/water.jpg'),
                  width: 300, // กำหนดความกว้างตามที่คุณต้องการ
                  height: 300,
                ),





                
               
              ],
            ),
          ),
        ],
      ),
    );
  }
}
