import 'package:flutter/material.dart';

class Tradition extends StatelessWidget {
  const Tradition({Key? key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('วัฒนธรรม'),
      ),
      body: ListView(
        children: const [
          Padding(
            padding: EdgeInsets.symmetric(horizontal: 20.0),
            child: Column(
              children: [
                Text(
                  'วัฒนธรรม ประเทศออสเตรเลีย',
                  style: TextStyle(fontSize: 18),
                ),

                SizedBox(height: 20),
                Text(
                  "วัฒนธรรมออสเตรเลียมีพื้นฐานอยู่บนเรื่องราวของนักต่อสู้ เจ้าหน้าที่ดูแลป่า และทหารผู้กล้า เรื่องราวของวีรบุรุษนักกีฬา วีรบุรุษนักทำงาน และนักอพยพผู้กล้า ทั้งหมดล้วนเป็นเรื่องของความเสมอภาค ชีวิตกลางแจ้งอันวิเศษ และการมีน้ำใจต่อผู้ถูกเย้ยหยัน ปัจจุบัน ออสเตรเลียยังนิยามตัวเองว่าเป็นมรดกของชาวอะบอริจิน การผสมผสานทางวัฒนธรรมอันมีสีสัน นวัตกรรมทางความคิด และแหล่งศิลปะอันรุ่งเรือง ",
                  textAlign: TextAlign.center,
                ),
                Image(
                  image: AssetImage('images/tradition.jpg'),
                  width: 300, // กำหนดความกว้างตามที่คุณต้องการ
                  height: 300,
                ),
                
                // เพิ่มข้อมูลเมนูอาหารอื่น ๆ ที่คุณต้องการแสดงที่นี่
                SizedBox(height: 20),
                Text(
                  "1. วัฒนธรรมอะบอริจิน: ประเพณีอันหลากหลายและเป็นนิรันดร์   ",
                  style: TextStyle(fontSize: 18),
                  textAlign: TextAlign.center,
                ),
               SizedBox(height: 20),
                Text(
                  "ยุคความฝัน Dreamtime คือ ‘ห้วงเวลาก่อนการเกิดเวลา’ อันศักดิ์สิทธิ์ของการสร้างโลก ตามความเชื่อของชาวอะบอริจิน บรรพบุรุษวิญญาณศักดิ์สิทธิ์ได้ขึ้นมาจากใต้พื้นโลก และลอยลงมาจากฟากฟ้าเพื่อปลุกโลกที่มืดมนและเงียบงันให้ตื่นจากหลับไหล พวกเขาสร้างดวงอาทิตย์ ดวงจันทร์ และดวงดาวต่าง ๆ หลอมรวมบรรดาภูเขา แม่น้ำ ต้นไม้ และแอ่งน้ำทั้งหลายเข้าด้วยกันจนอยู่ในรูปมนุษย์และสัตว์ บรรพบุรุษวิญญาณศักดิ์สิทธิ์เชื่อมโยงอดีตกาลโบราณนี้เข้ากับปัจจุบันและอนาคตผ่านทุกแง่มุมของวัฒนธรรมอะบอริจิน ศิลปะการเขียนภาพบนหิน งานฝีมือ และงานเขียนสีบนเปลือกไม้ แสดงให้เห็นเรื่องราวต่าง ๆ เกี่ยวกับยุคความฝัน แสดงขอบเขตดินแดน และบันทึกประวัติศาสตร์ ในขณะที่บทเพลงต่าง ๆ บอกถึงการเดินทางในยุคความฝัน โดยแสดงแหล่งน้ำและสถานที่สำคัญ ๆ ไว้เป็นคำพูด บทกวีพิเศษของพวกเขาได้รับการสืบสานเรื่อยมาโดยไม่เปลี่ยนแปลงนับเป็นเวลาอย่างน้อย 50,000 ปี และบ่อยครั้งจะประกอบด้วยเสียงเคาะไม้ให้จังหวะ หรือเสียงทุ้มต่ำของขลุ่ยไม้ดิดเกอร์ริดู (Didgeridoo) ในลักษณะที่คล้ายคลึงกันนี้ ระบำพื้นเมืองเผยให้เห็นตำนานการสร้าง แสดงการกระทำของวีรบุรุษแห่งยุคความฝัน และแม้แต่เหตุการณ์ทางประวัติศาสตร์ที่เกิดขึ้นไม่นานมานี้ ",
                  textAlign: TextAlign.center,
                ),
                //
                SizedBox(height: 20),
                Text(
                  "2. ตำนานแห่งอาณานิคม: นักต่อสู้ เจ้าหน้าที่ดูแลป่า และทหารผู้กล้า ",
                  style: TextStyle(fontSize: 18),
                  textAlign: TextAlign.center,
                ),
               SizedBox(height: 20),
                Text(
                  "ชาวออสเตรเลียศรัทธาในความเป็นเพื่อนแท้และ ‘ความเสมอภาค’ และมีความเมตตาอย่างมากต่อผู้ตกเป็นเบี้ยล่างหรือ ‘นักต่อสู้’ ค่านิยมเหล่านี้มีที่มาจากบรรดานักโทษและชาวอาณานิคมในช่วงแรกซึ่งต้องต่อสู้ในดินแดนที่ยากลำบากและไม่คุ้นเคย และบ่อยครั้งที่ต้องต่อสู้กับเจ้าหน้าที่บ้านเมืองที่ไม่มีความเป็นธรรม เจ้าหน้าที่ดูแลป่าที่มีชื่อเสียงมากที่สุดของออสเตรเลีย Ned Kelly เป็นผู้ต่อต้านความยากจนและความไม่ยุติธรรมในระบบชนชั้นของอังกฤษซึ่งติดตามมายังออสเตรเลียพร้อมกับบรรดานักโทษ การต่อสู้เพื่อ ‘ความยุติธรรมและเสรีภาพ’ และ ’ผู้บริสุทธิ์’ ของวีรบุรุษผู้มีมลทินนี้ ได้รับการยอมรับไว้เป็นส่วนหนึ่งของวัฒนธรรมประจำชาติของออสเตรเลีย และเป็นแรงบันดาลใจให้กับหนังสือและภาพยนตร์นับไม่ถ้วน ที่เหมืองทองคำในช่วงกลางทศวรรษ 1850 นักขุดทองถูกบรรยายไว้ในเรื่องราวและบทเพลงในฐานะวีรบุรุษผู้โรแมนติก คนจรจัดและวายร้ายผู้รักความเสมอภาค การต่อสู้นองเลือดกับเจ้าหน้าที่ของรัฐที่ค่ายยูเรกาในปี 1854 ซึ่งนักขุดทองชาววิกตอเรียลุกขึ้นต่อสู้กับระบบออกใบอนุญาตขุดทองแบบเผด็จการ ได้กลายมาเป็นสัญลักษณ์แห่งชัยชนะของความเท่าเทียมกันทางสังคม ต่อมาในระหว่างช่วงสงครามโลกครั้งที่หนึ่ง กองทหารผสมระหว่างออสเตรเลียและนิวซีแลนด์ผู้กล้าหาญ ซึ่งเข้ารบในสมรภูมิกัลลิโปลีได้ให้ความหมายใหม่แก่คำว่า ‘ออสซี่ผู้กล้าแกร่ง’  ",
                  textAlign: TextAlign.center,
                ),
                //
                SizedBox(height: 20),
                Text(
                  "3. นวัตกรรมที่สร้างสรรค์ในออสเตรเลีย: จากราวตากผ้าแบบปรับระดับ (Hill Hoist) จนถึงยาเพนนิซิลิน   ",
                  style: TextStyle(fontSize: 18),
                  textAlign: TextAlign.center,
                ),
                SizedBox(height: 20),
                Text(
                  "ลักษณะทางภูมิศาสตร์ที่มีเอกลักษณ์เฉพาะตัวของออสเตรเลียและตำแหน่งที่ตั้งที่อยู่อย่างเป็นเอกเทศ เอื้ออำนวยเป็นอย่างดีต่อการคิดค้นสิ่งใหม่ ๆ ในปี 1879 ชาวออสเตรเลียได้พัฒนาวิธีการผลิตน้ำแข็งเทียมขึ้น ซึ่งช่วยให้เราสามารถส่งออกผลิตภัณฑ์เนื้อสัตว์ไปยังสหราชอาณาจักรได้โดยขนส่งไปในเรือห้องเย็น ในปี 1906 รอกม้วนสำหรับช่วยชีวิตได้รับการออกแบบขึ้นเพื่อช่วยให้เจ้าหน้าที่กู้ภัยสามารถออกไปช่วยคนที่กำลังจะจมน้ำด้วยเชือกที่ติดกับเสื้อชูชีพของเจ้าหน้าที่ ในปี 1929 Alfred Traeger ได้ประดิษฐ์วิทยุที่อาศัยพลังงานจากการปั่นไฟฟ้าด้วยเท้า เพื่อใช้ในการสื่อสารของหน่วยแพทย์เวหา Royal Flying Doctor Service   ",
                  textAlign: TextAlign.center,
                ), //
                SizedBox(height: 20),
                Text(
                  "4. ความหลงใหลในวัฒนธรรม: โรงละคร ภาพยนตร์ หนังสือ และทัศนศิลป์  ",
                  style: TextStyle(fontSize: 18),
                  textAlign: TextAlign.center,
                ),
                SizedBox(height: 20),
                Text(
                  "จากโรงละครจนถึงวรรณกรรม ชาวออสเตรเลียมีความรักในศิลปะอย่างเงียบ ๆ เราพากันไปชมภาพยนตร์ จำนวนผู้เข้าเยี่ยมชมตามหอศิลป์และเวทีการแสดงมีมากเกือบเป็นสองเท่าของจำนวนผู้เข้าชมฟุตบอล เมืองใหญ่ ๆ ของเราเป็นเจ้าภาพจัดงานเทศกาลทางวัฒนธรรมที่สำคัญหลายเทศกาล เมืองเหล่านี้จัดการแสดงดนตรี ละคร เต้นรำ และงานแสดงผลงานศิลปะทุกวันตลอดสัปดาห์ ชมการแสดงเต้นรำพื้นเมืองของชาวอะบอริจินโดย Bangarra Dance Theatre สนุกสนานกับงานเทศกาลดนตรีนานาชาติ WOMADelaide International Music Festival ในเมืองแอดิเลด และดื่มด่ำกับวัฒนธรรมด้วยการชมละครเวที บัลเลต์ อุปรากร และภาพวาดในศูนย์วัฒนธรรมขนาดใหญ่ย่านเซาท์แบงก์ของเมืองบริสเบรน ในเมืองขนาดเล็ก คุณสามารถดูการแสดงของนักดนตรีพื้นเมือง และชมงานศิลปะและงานประดิษฐ์ที่ทำด้วยมือได้   ",
                  textAlign: TextAlign.center,
                ), //
             
              ],
            ),
          ),
        ],
      ),
    );
  }
}
