import 'package:flutter/material.dart';

class TravelPage extends StatelessWidget {
  const TravelPage({Key? key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('สถานที่ท่องเที่ยว'),
      ),
      body: ListView(
        children: const [
          Padding(
            padding: EdgeInsets.symmetric(horizontal: 20.0),
            child: Column(
              children: [
                Text(
                  'สถานที่ท่องเที่ยวในออสเตรเลีย?',
                  style: TextStyle(fontSize: 18),
                ),

                SizedBox(height: 20),
                Text(
                  "1. ซิดนีย์ โอเปร่าเฮาส์ (SYDNEY OPERA HOUSE)",
                  textAlign: TextAlign.center,
                ),
                Image(
                  image: AssetImage('images/sydney.jpg'),
                  width: 300, // กำหนดความกว้างตามที่คุณต้องการ
                  height: 300,
                ),
                Text(
                  "เมื่อนึกถึงออสเตรเลีย สิ่งแรกที่นึกถึงกันคงเป็นซิดนีย์ โอเปร่าเฮาส์ ใช่มั้ยล่ะครับ? แลนด์มาร์กยอดฮิตประจำเมืองซิดนีย์และสัญลักษณ์ประจำออสเตรเลียแห่งนี้ ถ้าใครไม่ได้มาแวะมาแชะรูปถือว่ายังมาไม่ถึงออสเตรเลียเลยนะขอบอก! นอกจากโอเปร่าเฮาส์จะโดดเด่นด้วยสถาปัตยกรรมที่มีความสวยงามแบบเก๋ไก๋สไลเดอร์แล้วนั้น ภายในยังมีโรงละครขนาดย่อยมากมาย รวมทั้งภัตตาคาร ร้านกาแฟ และบาร์น่านั่งอีกหลายแห่ง ถูกใจสายติสท์แน่นอน",
                  textAlign: TextAlign.center,
                ),
                // เพิ่มข้อมูลเมนูอาหารอื่น ๆ ที่คุณต้องการแสดงที่นี่
                SizedBox(height: 20),
                Text(
                  "2. ย่านเดอะร็อคส์ (THE ROCKS)  ",
                  textAlign: TextAlign.center,
                ),
                Image(
                  image: AssetImage('images/rock.jpg'),
                   width: 300, // กำหนดความกว้างตามที่คุณต้องการ
                  height: 300,
                ),
                Text(
                  "ย้อนเวลากลับไปช่วงยุคล่าอาณานิคมของอังกฤษที่ย่านเดอะร็อคส์ (The Rocks) บนถนนจอร์จ (Greoge Street) ทางทิศตะวันตกของย่านเซอร์คูลาร์คีย์ (Circular Quay) กัน! สถานที่แห่งนี้เป็นที่ที่ชาวยุโรปกลุ่มแรกย้ายมาตั้งถิ่นฐานเมื่อประมาณ 200 กว่าปีที่แล้ว อาคารบ้านเรือนต่าง ๆ ยังมีกลิ่นอายของประวัติศาสตร์อย่างชัดเจน รายล้อมไปด้วยพิพิธภัณฑ์ ภัตตาคาร คาเฟ่ และบาร์ ที่มีมากกว่า 50 แห่ง แถมผับที่เก่าแก่ที่สุดในซิดนีย์ก็อยู่ที่นี่ด้วยนะ! เป็นอีกหนึ่งไฮไลท์ของซิดนีย์ที่ต้องห้ามพลาดเลยล่ะ แค่มาเดินเล่นซึมซับบรรยากาศพร้อมชมอาคารสไตล์ยุโรปโบราณก็ฟินแล้ว~ ที่นี่ยังเป็นแหล่งที่อยู่อาศัยของนกนางนวลจำนวนมาก และสามารถมองเห็นสะพานฮาร์เบอร์ได้อย่างชัดเจนเลย",
                  textAlign: TextAlign.center,
                ),
                //
                SizedBox(height: 20),
                Text(
                  "3. สะพานฮาร์เบอร์ (HARBOUR BRIDGE)  ",
                  textAlign: TextAlign.center,
                ),
                Image(
                  image: AssetImage('images/harbour.jpg'),
                   width: 300, // กำหนดความกว้างตามที่คุณต้องการ
                  height: 300,
                ),
                Text(
                  "ออกจากย่านเดอะร็อคส์ก็ไปต่อกันที่สะพานฮาร์เบอร์กันเลยจ้า อีกหนึ่งสัญลักษณ์ประจำออสเตรเลียแห่งนี้ได้ชื่อว่าเป็นหนึ่งในสะพานเหล็กที่ใหญ่ที่สุดในโลก สร้างขึ้นเพื่อเป็นสัญลักษณ์แห่งความหวังในช่วงที่ออสเตรเลียมีเศรษฐกิจตกต่ำ โดยเป็นสะพานที่ทอดยาวเชื่อมเมืองซิดนีย์ฝั่งเหนือและใต้เข้าไว้ด้วยกัน และมีชื่อเล่นน่ารัก ๆ ที่ชาวซิดนีย์เรียกกันว่า “ไม้แขวนเสื้อ” เนื่องจากโครงสร้างของสะพานเหล็กที่ถักเป็นทรงโค้ง ดูคล้ายกับไม้แขวนเสื้อนั่นเอง นอกจากการชมความสวยงามของอ่าวซิดนีย์จากบนสะพานฮาร์เบอร์แล้ว กิจกรรมอีกอย่างที่เป็นที่นิยมไม่แพ้กันก็คือการไต่สะพาน สะพานฮาร์เบอร์เป็น 1 ใน 2 สะพานของออสเตรเลียที่อนุญาตให้ทำกิจกรรมแบบนี้ได้ สายแอดเวนเจอร์ทั้งหลายต้องลองแล้วมั้ยล่ะ! ใครที่อยากมาเดินเล่นชมวิวชิลล์ ๆ ก็มากันได้เลย ที่นี่เปิดตลอดไม่มีวันหยุด เว้นแต่บางช่วงที่ต้องปิดสะพานเพื่อจัดกิจกรรม เช่น การวิ่งมาราธอน",
                  textAlign: TextAlign.center,
                ),
                //
                SizedBox(height: 20),
                Text(
                  "4. หาดบอนได (BONDI BEACH)  ",
                  textAlign: TextAlign.center,
                ),
                Image(
                  image: AssetImage('images/bon.jpg'),
                   width: 300, // กำหนดความกว้างตามที่คุณต้องการ
                  height: 300,
                ),
                Text(
                  "นอกจากโอเปร่าเฮาส์และสะพานฮาร์เบอร์จะเป็นแหล่งท่องเที่ยวยอดนิยมประจำเมืองซิดนีย์แล้ว หาดบอนไดก็ฮอตไม่แพ้กัน ยิ่งคนรักการเล่นเซิร์ฟด้วยแล้วล่ะก็ ที่นี่คือสวรรค์ดี ๆ นี่เอง! คลื่นของที่นี่เหมาะแก่การเล่นเซิร์ฟมาก ๆ ใครอยากลองเล่นเซิร์ฟก็สามารถเรียนได้ที่โรงเรียนสอนเล่นเซิร์ฟได้เลย หาดบอนไดยังขึ้นชื่อเรื่องความสวยงามของหาดทรายสีขาวที่มีลักษณะเป็นรูปพระจันทร์เสี้ยวและน้ำทะเลสีฟ้าเทอร์ควอยซ์อีกด้วย แถมรายล้อมไปด้วยร้านอาหาร คาเฟ่ ร้านขายของที่ระลึก ร้านค้าแฟชั่นอีกมากมาย ",
                  textAlign: TextAlign.center,
                ), //
                SizedBox(height: 20),
                Text(
                  "5.  ตึกควีนวิกตอเรีย (QUEEN VICTORIA BUILDING)  ",
                  textAlign: TextAlign.center,
                ),
                Image(
                  image: AssetImage('images/queen.jpg'),
                width: 300, // กำหนดความกว้างตามที่คุณต้องการ
                  height: 300,
                ),
                Text(
                  "แหล่งชอปปิงใจกลางเมืองซิดนีย์ที่มีอายุเก่าแก่มากกว่า 100 ปี โดดเด่นด้วยสถาปัตยกรรมฟื้นฟูโรมาเนสก์ มีความสวยงามสุดคลาสสิกจนเปรียบได้เป็น “มงกุฎประดับอัญมณีล้ำค่าแห่งเมืองซิดนีย์” ที่นี่เต็มไปด้วยร้านแบรนด์เนม ร้านขายสินค้าแนวสตรีท ร้านรวงต่าง ๆ ร้านอาหาร ร้านกาแฟ ฯลฯ เรียกได้ว่ามาที่เดียวครบ ตอบโจทย์สายชอปทุกรูปแบบกันไปเลยจ้า! หรือจะมาเดินเล่นชมการประดับตกแต่งภายในของอาคารก็เพลินไม่แพ้กัน ยิ่งใครได้มาช่วงคริสต์มาสนะ ที่นี่จะรายล้อมไปด้วยบรรยากาศแห่งการเฉลิมฉลอง ร้านต่าง ๆ จะพากันตกแต่งในธีมคริสต์มาส คนรักเทศกาลนี้มีฟินอ่ะบอกเลย สำหรับใครที่ตกหลุมรักความมีเสน่ห์ชวนหลงใหลจนอยากสำรวจตึกควีนวิกตอเรียแบบลงดีเทลล่ะก็ สามารถเข้าร่วมทัวร์ได้เลยจ้า ซึ่งก็มีค่าใช้จ่ายในการทัวร์แต่รับรองเลยว่าคุ้ม! ",
                  textAlign: TextAlign.center,
                ),
                //
                SizedBox(height: 20),
                Text(
                  "6. เมืองแอดิเลด (ADELAIDE) แหล่งผลิตไวน์ชั้นเยี่ยมในรัฐเซาท์ออสเตรเลีย  ",
                  textAlign: TextAlign.center,
                ),
                Image(
                  image: AssetImage('images/ade.jpg'),
                  width: 300, // กำหนดความกว้างตามที่คุณต้องการ
                  height: 300,
                ),
                Text(
                  "แม้อาจไม่ได้รับความนิยมมากกว่าเมืองอื่น ๆ เช่น ซิดนีย์ หรือเมลเบิร์น แต่สำหรับคนรักไวน์ตัวจริง เมื่อได้ยินชื่อเมืองแอดิเลดแล้วเป็นต้องหูผึ่งกันแน่นอน! เมืองแอดิเลดถือเป็นแหล่งขุมทรัพย์ของไวน์ชั้นเลิศที่มีชื่อเสียงระดับโลกมากมาย ไม่ว่าจะเป็น เจคอบส์ ครีก (Jacob’s Creek) วินดอม เอสเตส (Wyndham Estate) เพนฟอยด์ (Penfolds) ชองดอง (Chandon) ฯลฯ เมืองแอดิเลดยังติดอันดับ 1 ใน 10 เมืองที่น่าอยู่ที่สุดในโลก ประจำปี 2021 ด้วยความมีชีวิตชีวาของเมืองและความอุดมสมบูรณ์ของธรรมชาติ เต็มไปด้วยกลิ่นอายของศิลปะและวัฒนธรรม แถมการคมนาคมยังสะดวกสบายสุด ๆ ใครที่ไม่ใช่สายชิมไวน์ก็สามารถมาเดินชอปปิง ชมพิพิธภัณธ์ หอสมุด ดูสวนพฤกษศาสตร์ หรือจะมาแวะมาเยี่ยมน้องจิงโจ้กับน้องโคอาล่าก็ได้นะ ",
                  textAlign: TextAlign.center,
                ),
              ],
            ),
          ),
        ],
      ),
    );
  }
}
